# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Jonas\Dropbox\IRT PSoC4 solutions\E4IRT_EX6\IRT_EX6_2\IRT_EX6_2.cydsn\IRT_EX6_2.cyprj
# Date: Thu, 12 Mar 2015 18:55:13 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_1_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Clock_1(routed)} -period 10000000 -waveform {0 5000000} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {ADC_DelSig_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 31 61} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {ADC_DelSig_1_theACLK(fixed-function)} -period 1250 -waveform {0 625} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 240001 480001} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Jonas\Dropbox\IRT PSoC4 solutions\E4IRT_EX6\IRT_EX6_2\IRT_EX6_2.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Jonas\Dropbox\IRT PSoC4 solutions\E4IRT_EX6\IRT_EX6_2\IRT_EX6_2.cydsn\IRT_EX6_2.cyprj
# Date: Thu, 12 Mar 2015 18:55:06 GMT
